# RbsPipeAdditionalFlowParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsPipeAdditionalFlowParam Property
ParameterTypeId Class See Also
---
"Additional Flow"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsPipeAdditionalFlowParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsPipeAdditionalFlowParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsPipeAdditionalFlowParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace